Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: 2. The method according to claim 1, wherein the ith group of preambles in the KG groups of preambles corresponds to at least one piece of TA information, and at least one TA value corresponding to the ith group of preambles is different from at least one TA value corresponding to a jth group of preambles, wherein both i and j are non-negative integers less than KG, and values of i and j are different.
de_de: 2. Verfahren nach Anspruch 1, wobei die i-te Gruppe von Präambeln in den KG Gruppen von Präambeln mindestens einem Teil von TA-Informationen entspricht und sich mindestens ein der i-ten Gruppe von Präambeln entsprechende TA-Wert von mindestens einem einer j-ten Gruppe von Präambeln entsprechenden TA-Wert unterscheidet, wobei sowohl i als auch j nicht-negative Ganzzahlen kleiner als KG sind und die Werte von i und j unterschiedlich sind.

source: 3. The method according to any one of claims 1 to 2, wherein the ith group of preambles in the KG groups of preambles corresponds to a first TA value range, and the first TA value range corresponding to the ith group of preambles does not overlap a second TA value range corresponding to the jth group of preambles, wherein both i and j are the non-negative integers less than KG, and the values of i and j are different.
de_de: 3. Verfahren nach einem der Ansprüche 1 bis 2, wobei die i-te Gruppe von Präambeln in den KG Gruppen von Präambeln einem ersten TA-Wertebereich entspricht und der erste der i-ten Gruppe von Präambeln entsprechende TA-Wertebereich sich nicht mit einem zweiten der j-ten Gruppe von Präambeln entsprechenden TA-Wertebereich überschneidet, wobei sowohl i als auch j nicht-negative Ganzzahlen kleiner als KGsind und die Werte von i und j unterschiedlich sind.

source: 4. The method according to claim 3, wherein a range of the first TA value range is related to the quantity KG of groups of preambles and a maximum TA value.
de_de: 4. Verfahren nach Anspruch 3, wobei ein Bereich des ersten TA-Wertebereichs auf die Menge KG der Gruppen von Präambeln und einen maximalen TA-Wert bezogen ist.

source: 5. The method according to claim 1, wherein the first information is the historical TA information of the first communication apparatus (120), and the first parameter is the historical TA information of the first communication apparatus (120).
de_de: 5. Verfahren nach Anspruch 1, wobei die ersten Informationen die historischen TA-Informationen der ersten Kommunikationsvorrichtung (120) sind und der erste Parameter die historischen TA-Informationen der ersten Kommunikationsvorrichtung (120) ist.

source: 6. The method according to claim 1, wherein the first information is the geographical location information of the first communication apparatus (120), and the geographical location information of the first communication apparatus (120) is a distance between the first communication apparatus (120) and the network device (502); and
de_de: 6. Verfahren nach Anspruch 1, wobei die ersten Informationen die geografischen Standortinformationen der ersten Kommunikationsvorrichtung (120) sind und die geografischen Standortinformationen der ersten Kommunikationsvorrichtung (120) eine Entfernung zwischen der ersten Kommunikationsvorrichtung (120) und der Netzwerkvorrichtung (502) sind; und

source: the determining, by the first communication apparatus (120), a first parameter based on the first information comprises:
de_de: das Bestimmen eines ersten Parameters basierend auf den ersten Informationen durch die erste Kommunikationsvorrichtung (120) Folgendes umfasst:

source: determining, by the first communication apparatus (120), the first parameter based on the distance between the first communication apparatus (120) and the network device (502), a cell radius of a cell in which the first communication apparatus (120) is located, and a maximum TA value, wherein the first parameter is TA information, and the first parameter is the same as one of at least one piece of TA information corresponding to the one group of preambles determined from the KG groups of preambles.
de_de: Bestimmen des ersten Parameters durch die erste Kommunikationsvorrichtung (120) basierend auf der Entfernung zwischen der ersten Kommunikationsvorrichtung (120) und der Netzwerkvorrichtung (502), einem Zellenradius einer Zelle, in der sich die erste Kommunikationsvorrichtung (120) befindet, und einem maximalen TA-Wert, wobei der erste Parameter TA-Informationen ist und der erste Parameter derselbe ist wie einer von mindestens einem Teil von TA-Informationen, die der einen Gruppe von Präambeln entspricht, die aus den KG Gruppen von Präambeln bestimmt wurde.

source: 7. The method according to claim 1, wherein the first information is the historical TA information of the first communication apparatus (120) and the geographical location information of the first communication apparatus (120), and the geographical location information of the first communication apparatus (120) is a distance between the first communication apparatus (120) and the network device (502); and
de_de: 7. Verfahren nach Anspruch 1, wobei die ersten Informationen die historischen TA-Informationen der ersten Kommunikationsvorrichtung (120) und die geografischen Standortinformationen der ersten Kommunikationsvorrichtung (120) sind und die geografischen Standortinformationen der ersten Kommunikationsvorrichtung (120) eine Entfernung zwischen der ersten Kommunikationsvorrichtung (120) und der Netzwerkvorrichtung (502) sind; und

source: determining, by the first communication apparatus (120), the first parameter based on a historical TA value of the first communication apparatus (120), the distance between the first communication apparatus (120) and the network device (502), a cell radius of a cell in which the first communication apparatus (120) is located, and a maximum TA value, wherein the first parameter is TA information, and the first parameter is the same as one of at least one piece of TA information corresponding to the one group of preambles determined from the KG groups of preambles.
de_de: Bestimmen des ersten Parameters durch die erste Kommunikationsvorrichtung (120) basierend auf einem historischen TA-Wert der ersten Kommunikationsvorrichtung (120), der Entfernung zwischen der ersten Kommunikationsvorrichtung (120) und der Netzwerkvorrichtung (502), einem Zellenradius einer Zelle, in der sich die erste Kommunikationsvorrichtung (120) befindet, und einem maximalen TA-Wert, wobei der erste Parameter TA-Informationen ist und der erste Parameter derselbe ist wie einer von mindestens einem Teil von TA-Informationen, die der einen Gruppe von Präambeln entspricht, die aus den KG Gruppen von Präambeln bestimmt wurde.

source: 8. The method according to claim 1, wherein an ith group of preambles in the KG groups of preambles corresponds to at least one radius value, and the at least one radius value corresponding to the ith group of preambles is different from at least one radius value corresponding to a jth group of preambles, wherein both i and j are non-negative integers less than KG, and values of i and j are different.
de_de: 8. Verfahren nach Anspruch 1, wobei eine i-te Gruppe von Präambeln in den KG Gruppen von Präambeln mindestens einem Radiuswert entspricht und sich der mindestens eine der i-ten Gruppe von Präambeln entsprechende Radiuswert von mindestens einem einer j-ten Gruppe von Präambeln entsprechenden Radiuswert unterscheidet, wobei sowohl i als auch j nicht-negative Ganzzahlen kleiner als KG sind und die Werte von i und j unterschiedlich sind.

source: 9. The method according to claim 1 or 8, wherein the ith group of preambles in the KG groups of preambles corresponds to a first radius value range, and the first radius value range corresponding to the ith group of preambles does not overlap a second radius value range corresponding to the jth group of preambles, wherein both i and j are the non-negative integers less than KG, and the values of i and j are different.
de_de: 9. Verfahren nach Anspruch 1 bis 8, wobei die i-te Gruppe von Präambeln in den KG Gruppen von Präambeln einem ersten Radiuswertebereich entspricht und der erste der i-ten Gruppe von Präambeln entsprechende Radiuswertebereich sich nicht mit einem zweiten der j-ten Gruppe von Präambeln entsprechenden Radiuswertebereich überschneidet, wobei sowohl i als auch j nicht-negative Ganzzahlen kleiner als KG sind und die Werte von i und j unterschiedlich sind.

source: The method according to claim 9, wherein a range of the first radius value range is related to the quantity KG of groups of preambles and a cell radius of a cell in which the first communication apparatus (120) is located.
de_de: Verfahren gemäß Anspruch 9, wobei ein Bereich des ersten Radiuswertebereichs auf die Menge KG von Gruppen von Präambeln und einem Zellenradius einer Zelle bezogen ist, in der sich die erste Kommunikationsvorrichtung (120) befindet.

source: The method according to claim 1, wherein the first information is the geographical location information of the first communication apparatus (120), the geographical location information of the first communication apparatus (120) is a distance between the first communication apparatus (120) and the network device (502), and the first parameter is the geographical location information of the first communication apparatus (120).
de_de: Verfahren nach Anspruch 1, wobei die ersten Informationen die geografischen Standortinformationen der ersten Kommunikationsvorrichtung (120) sind, die geografischen Standortinformationen der ersten Kommunikationsvorrichtung (120) eine Entfernung zwischen der ersten Kommunikationsvorrichtung (120) und der Netzwerkvorrichtung (502) sind, und der erste Parameter die geographischen Informationen der ersten Kommunikationsvorrichtung (120) ist.

source: The method according to claim 1, wherein the first information is the historical TA information of the first communication apparatus (120); and
de_de: Verfahren gemäß Anspruch 1, wobei die ersten Informationen die historischen TA-Informationen der ersten Kommunikationsvorrichtung (120) sind; und

source: determining, by the first communication apparatus (120), the first parameter based on a historical TA value of the first communication apparatus (120), a cell radius of a cell in which the first communication apparatus (120) is located, and a maximum TA value, wherein the first parameter is a radius value, and the first parameter is the same as one of at least one radius value corresponding to the one group of preambles determined from the KG groups of preambles.
de_de: Bestimmen des ersten Parameters durch die erste Kommunikationsvorrichtung (120) basierend auf einem historischen TA-Wert der ersten Kommunikationsvorrichtung (120), einem Zellenradius einer Zelle, in der sich die erste Kommunikationsvorrichtung (120) befindet, und einem maximalen TA-Wert, wobei der erste Parameter ein Radiuswert ist und der erste Parameter derselbe ist wie einer von mindestens einem Radiuswert, der der einen Gruppe von Präambeln entspricht, die aus den KG Gruppen von Präambeln bestimmt wurde.

source: The method according to claim 1, wherein the first information is the historical TA information of the first communication apparatus (120) and the geographical location information of the first communication apparatus (120), and the geographical location information of the first communication apparatus (120) is a distance between the first communication apparatus (120) and the network device (502); and
de_de: Verfahren nach Anspruch 1, wobei die ersten Informationen die historischen TA-Informationen der ersten Kommunikationsvorrichtung (120) und die geografischen Standortinformationen der ersten Kommunikationsvorrichtung (120) sind und die geografischen Standortinformationen der ersten Kommunikationsvorrichtung (120) eine Entfernung zwischen der ersten Kommunikationsvorrichtung (120) und der Netzwerkvorrichtung (502) sind; und

source: determining, by the first communication apparatus (120), the first parameter based on a historical TA value of the first communication apparatus (120), the distance between the first communication apparatus (120) and the network device (502), a cell radius of a cell in which the first communication apparatus (120) is located, and a maximum TA value, wherein the first parameter is a radius value, and the first parameter is the same as one of at least one radius value corresponding to the one group of preambles determined from the KG groups of preambles.
de_de: Bestimmen des ersten Parameters durch die erste Kommunikationsvorrichtung (120) basierend auf einem historischen TA-Wert der ersten Kommunikationsvorrichtung (120), der Entfernung zwischen der ersten Kommunikationsvorrichtung (120) und der Netzwerkvorrichtung (502), einem Zellenradius einer Zelle, in der sich die erste Kommunikationsvorrichtung (120) befindet, und einem maximalen TA-Wert, wobei der erste Parameter ein Radiuswert ist und der erste Parameter derselbe ist wie einer von mindestens einem Radiuswert, der der einen Gruppe von Präambeln entspricht, die aus den KG Gruppen von Präambeln bestimmt wurde.

source: 1. A method comprising:
de_de: 1. Verfahren, umfassend:

source: a user equipment, UE (760), receiving configuration information to allow hybrid automatic repeat request, HARQ, process sharing across multiple radio link types;
de_de: Empfangen, durch eine Benutzerausrüstung, UE (760), von Konfigurationsinformationen, um eine gemeinsame Nutzung hybrider automatischer Wiederholungsanforderungsprozesse, HARQ-Prozesse, über mehrere Funkverbindungstypen zu ermöglichen;

source: the UE (760) receiving a first downlink control information, DCI, for scheduling a first transmission of a transport block, TB, in a first physical resource associated with a first radio link type, the first DCI comprising a first HARQ process ID;
de_de: Empfangen, durch die UE (760), einer ersten Downlink-Steuerinformation, DCI, zum Planen einer ersten Übertragung eines Transportblocks, TB, in einer ersten physikalischen Ressource, die mit einem ersten Funkverbindungstyp verknüpft ist, wobei die erste DCI eine erste HARQ-Prozess-ID umfasst;

source: the UE (760) receiving a second DCI for scheduling a retransmission of at least a portion of the TB in a second physical resource associated with a second radio link type, the second DCI comprising a second HARQ process ID;
de_de: Empfangen, durch das UE (760), einer zweiten DCI zum Planen einer erneuten Übertragung mindestens eines Teils des TB in einer zweiten physikalischen Ressource, die mit einem zweiten Funkverbindungstyp verknüpft ist, wobei die zweite DCI eine zweite HARQ-Prozess-ID umfasst;

source: communicating, by the UE (760), with a first access node (730), in the first physical resource associated with the first radio link type, the first transmission with the first HARQ process ID and,
de_de: Kommunizieren, durch die UE (760), mit einem ersten Zugangsknoten (730), in der ersten physikalischen Ressource, die mit dem ersten Funkverbindungstyp verknüpft ist, der ersten Übertragung mit der ersten HARQ-Prozess-ID, und

source: communicating, by the UE (760), with a second access node (740) in the second physical resource associated with the second radio link type, the second transmission with the second HARQ process ID;
de_de: Kommunizieren, durch die UE (760), mit einem zweiten Zugangsknoten (740) in der zweiten physikalischen Ressource, die mit dem zweiten Funkverbindungstyp verknüpft ist, der zweiten Übertragung mit der zweiten HARQ-Prozess-ID;

source: wherein the configuration information comprises at least one of:
de_de: wobei die Konfigurationsinformationen mindestens eines von Folgendem umfassen:

source: a new data indicator, NDI;
de_de: einen neuen Datenindikator, NDI;

source: a HARQ process identifier, ID, associated with the HARQ process;
de_de: eine HARQ-Prozesskennung, HARQ-Prozess-ID, die mit dem HARQ-Prozess verknüpft ist;

source: a redundancy version, RV value;
de_de: einen Redundanzversions-, RV-, Wert;

source: a number of blind repetitions;
de_de: eine Anzahl von Blindwiederholungen;

source: a time offset for transmitting the feedback information
de_de: einen Zeitversatz zum Übertragen der Rückmeldungsinformationen;

source: a time window for receiving the retransmission;
de_de: ein Zeitfenster zum Empfangen der erneuten Übertragung;

source: a beam direction indication for transmitting the feedback information; and
de_de: eine Strahlrichtungsangabe zum Übertragen der Rückmeldungsinformationen; und

source: a beam direction indication for receiving the retransmission, and
de_de: eine Strahlrichtungsangabe zum Empfangen der erneuten Übertragung, und

source: wherein the first HARQ process ID and the second HARQ process ID map to a shared HARQ process;
de_de: wobei die erste HARQ-Prozess-ID und die zweite HARQ-Prozess-ID einem gemeinsam genutzten HARQ-Prozess zugeordnet sind;

source: wherein the first radio link is a non-terrestrial network, NTN, radio link and the first access node (730) is a NTN access node or an integrated access backhaul, IAB, NTN node; and
de_de: wobei die erste Funkverbindung eine nicht-terrestrische Netzwerk-, NTN-, Funkverbindung ist und der erste Zugangsknoten (730) ein NTN-Zugangsknoten oder ein integrierter Zugangs-Backhaul-, IAB-, NTN-Knoten ist; und

source: wherein the second radio link is a terrestrial network, TN, radio link and the second access node (740) is a TN access node or an IAB TN node.
de_de: wobei die zweite Funkverbindung eine terrestrische Netzwerk-, TN-, Funkverbindung ist und der zweite Zugangsknoten (740) ein TN-Zugangsknoten oder ein IAB-TN-Knoten ist.

source: 2. The method of claim 1, wherein the configuration information further comprises at least one mapping, rule, or parameter in respect of a rule that associates the second HARQ process ID with the first HARQ process ID.
de_de: 2. Verfahren nach Anspruch 1, wobei die Konfigurationsinformationen ferner mindestens eine Abbildung, Regel oder einen Parameter in Bezug auf eine Regel umfassen, die die zweite HARQ-Prozess-ID mit der ersten HARQ-Prozess-ID verknüpft.

source: 3. The method of claim 1 or 2, wherein receiving the configuration information comprises receiving an association between the first HARQ process ID and the second HARQ process ID in a semi-static manner.
de_de: 3. Verfahren nach Anspruch 1 oder 2, wobei das Empfangen der Konfigurationsinformationen das Empfangen einer Verknüpfung zwischen der ersten HARQ-Prozess-ID und der zweiten HARQ-Prozess-ID auf halbstatische Weise umfasst.

source: 4. The method of any one of claims 1 to 3, wherein the configuration information comprises an index offset indicating an index offset between the first and second HARQ process IDs.
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei die Konfigurationsinformationen einen Indexversatz umfassen, der einen Indexversatz zwischen den ersten und zweiten HARQ-Prozess-IDs angibt.

source: 5. The method of any one of claims 1 to 4, wherein the configuration information further comprises a number of shifts between the first and second HARQ process IDs.
de_de: 5. Verfahren nach einem der Ansprüche 1 bis 4, wobei die Konfigurationsinformationen ferner eine Anzahl von Verschiebungen zwischen den ersten und zweiten HARQ-Prozess-IDs umfassen.

source: 6. The method of any one of claims 1 to 5, further comprising receiving a HARQ codebook configuration indicating acknowledgement/negative acknowledgment, ACK/NACK, resources used for transmitting an ACK/NACK in respect of the TB or versions of the TB received over multiple physical resources.
de_de: 6. Verfahren nach einem der Ansprüche 1 bis 5, ferner umfassend Empfangen einer HARQ-Codebuch-Konfiguration, die Bestätigungs-/Negativbestätigungs-, ACK/NACK-, Ressourcen anzeigt, die zum Übertragen einer ACK/NACK in Bezug auf den TB oder Versionen des TB, die über mehrere physikalische Ressourcen empfangen werden, verwendet werden.

source: 7. The method of claim 6, wherein the HARQ codebook configuration indicates an ACK/NACK resource for transmitting an ACK/NACK in respect of the TB or versions of the TB received over multiple physical resources.
de_de: 7. Verfahren nach Anspruch 6, wobei die HARQ-Codebuch-Konfiguration eine ACK/NACK-Ressource zum Übertragen einer ACK/NACK in Bezug auf den TB oder Versionen des TB, die über mehrere physikalische Ressourcen empfangen werden, anzeigt.

source: 8. The method of any one of claims 1 to 7, wherein the first DCI comprises a first field indicating that there is a DCI in respect of the TB on a different physical resource; and
de_de: 8. Verfahren nach einem der Ansprüche 1 bis 7, wobei die erste DCI ein erstes Feld umfasst, das angibt, dass es eine DCI in Bezug auf den TB auf einer anderen physikalischen Ressource gibt; und

source: the second DCI comprises a second field indicating that the second DCI is in respect to the TB transported on the different physical resource.
de_de: die zweite DCI ein zweites Feld umfasst, das angibt, dass die zweite DCI in Bezug auf den TB ist, der auf der anderen physikalischen Ressource transportiert wird.

source: 9. The method of claim 8, wherein the configuration information further comprises at least one semi-statically configured mapping rule that associates the first HARQ process ID on the first physical resource with the second HARQ process ID on the second physical resource, and wherein the first DCI including the first field and the second DCI including the second field together indicate that the first and second DCIs are in respect to the TB only when the first HARQ process ID is associated with the second HARQ process ID through the at least one mapping rule.
de_de: 9. Verfahren nach Anspruch 8, wobei die Konfigurationsinformationen ferner mindestens eine halbstatisch konfigurierte Abbildungsregel umfassen, die die erste HARQ-Prozess-ID auf der ersten physikalischen Ressource mit der zweiten HARQ-Prozess-ID auf der zweiten physikalischen Ressource verknüpft, und wobei die erste DCI, die das erste Feld enthält, und die zweite DCI, die das zweite Feld enthält, zusammen angeben, dass sich die erste und die zweite DCI nur auf auf den TB beziehen, wenn die erste HARQ-Prozess-ID mit der zweiten HARQ-Prozess-ID durch die mindestens eine Abbildungsregel verknüpft ist.

source: The method of any one of claims 1 to 9, further comprising transmitting, by the UE, ACK/NACK feedback on the first physical resource and/or the second physical resource.
de_de: Verfahren nach einem der Ansprüche 1 bis 9, ferner umfassend das Übertragen, durch die UE, einer ACK/NACK-Rückmeldung auf der ersten physikalischen Ressource und/oder der zweiten physikalischen Ressource.

source: The method of any one of claims 1 to 10, wherein the first or second physical resource is an unlicensed physical resource.
de_de: Verfahren nach einem der Ansprüche 1 bis 10, wobei die erste oder zweite physikalische Ressource eine nicht lizenzierte physikalische Ressource ist.

source: The method of any one of claims 1 to 11, wherein the first DCI comprises a first TB size indicator indicating a size of a first TB and a first NDI; and
de_de: Verfahren nach einem der Ansprüche 1 bis 11, wobei die erste DCI einen ersten TB-Größenindikator umfasst, der eine Größe eines ersten TB und eines ersten NDI angibt; und

source: wherein the second DCI comprises a second indicator DCI indicate the same TB size, and wherein the first NDI and a second NDI are the same.
de_de: wobei die zweite DCI einen zweiten Indikator umfasst, der dieselbe TB-Größe angibt, und wobei der erste NDI und ein zweiter NDI gleich sind.

source: The method of any one of claims 1 to 12, wherein:
de_de: Verfahren nach einem der Ansprüche 1 bis 12, wobei:
